INSERT INTO item (id, characteristics, code, count, created_on, description, name, price, weight, category_id, image) VALUES (6, 'Автор....................Харроп Роб, Шефер Крис, Козмина Юлиана
Издательство.............Диалектика / Вильямс
Страниц..................1120
Переплёт.................Твёрдый
ISBN.....................978-5-907114-07-4, 978-1-4842-2807-4', 'e43a71c7', 300, '2020-06-16 00:31:52.807', 'Эта книга воплощает знания и опыт работы авторов с каркасом Spring Framework и сопутствующими технологиями удаленного взаимодействия, Hibernate, EJB и пр. Она дает возможность читателю не только усвоить основные понятия и принципы работы с Spring Framework, но и научиться рационально пользоваться этим каркасом для построения различных уровней и частей корпоративных приложений на языке Java, включая обработку транзакций, представление веб-содержимого и прочего содержимого, развертывание и многое другое. Полноценные примеры подобных приложений, представленные в этой книге, наглядно демонстрируют особенности совместного применения различных технологий и методик разработки приложений в Spring.
Пятое издание этой книги, давно уже пользующейся успехом у читателей, обновлено по новой версии Spring Framework 5 и является самым исчерпывающим и полным руководством по применению Spring среди всех имеющихся. В нем представлен новый функциональный каркас веб-приложений, микрослужбы, совместимость с версией Java 9 и прочие функциональные возможности Spring. Прочитав эту обстоятельную книгу, вы сможете включить в арсенал своих средств весь потенциал Spring для основательного построения сложных приложений. Гибкий, легковесный каркас Spring Framework с открытым кодом продолжает оставаться фактически ведущим в области разработки корпоративных приложений на языке Java и самым востребованным среди разработчиков и программирующих на Java. Он превосходно взаимодействует с другими гибкими, легковесными технологиями Java с открытым кодом, включая Hibernate, Groovy, MyBatis и прочие, а также с платформами Java ЕЕ и JPA 2.
Эта книга поможет вам:
• Выявить новые функциональные возможности в версии Spring Framework 5
• Научиться пользоваться Spring Framework вместе с Java 9
• Овладеть механизмом доступа к данным и обработки транзакций
• Освоить новый функциональный каркас веб-приложений
• Научиться создавать микрослужбы и другие веб-службы', 'Spring 5 для профессионалов', 4000, 1.592, 3, 'images/spring5ForProfessionals.jpg');
INSERT INTO item (id, characteristics, code, count, created_on, description, name, price, weight, category_id, image) VALUES (7, 'Автор....................Чакон Скотт, Штрауб Бен
Издательство.............Питер
Страниц..................496
Переплёт.................Мягкий
ISBN.....................978-5-496-01763-3, 978-5-4461-1131-2', 'f6e7cd7d', 700, '2020-06-16 00:31:52.809', 'Эта книга представляет собой обновленное руководство по использованию Git в современных условиях. С тех пор как проект Git — распределенная система управления версиями — был создан Линусом Торвальдсом, прошло много лет, и система Git превратилась в доминирующую систему контроля версий, как для коммерческих целей, так и для проектов с открытым исходным кодом. Эффективный и хорошо реализованный контроль версий необходим для любого успешного веб-проекта. Постепенно эту систему приняли на вооружение практически все сообщества разработчиков ПО с открытым исходным кодом. Появление огромного числа графических интерфейсов для всех платформ и поддержка IDE позволили внедрить Git в операционные системы семейства Windows. Второе издание книги было обновлено для Git-версии 2.0 и уделяет большое внимание GitHub.', 'Git для профессионального программиста', 1075, 0.51, 3, 'images/proGit.jpg');


INSERT INTO item (id, characteristics, code, count, created_on, description, name, price, weight, category_id, image) VALUES (8, 'Автор....................Огами Т.
Издательство.............ДМК Пресс
Страниц..................130
Переплёт.................Мягкий
ISBN.....................978-5-97060-814-2', 'b25de2f9', 5000, '2020-06-16 00:31:52.795', 'Если раньше дифференциальные и интегральные исчисления были только уделом математиков, сегодня эту тему уже проходят в старших классах школы. Однако те, кто в дальнейшем не связывает свою жизнь с математикой, с трудом представляют, в какой сфере можно применить эти знания.

В этой книге производные и интегралы рассматриваются не только в историческом, но и в практическом контексте. Читатель узнает о том, какую роль они сыграли в наблюдении за звездами, какова связь между функциями и выражением наклона, между интегрированием и делением земель. Иллюстрации помогают представить математические задачи образно, а любопытные факты из жизни ученых удачно дополняют изложение теории.

Издание предназначено для старшеклассников, студентов вузов и всех любителей математики.', 'Производные и интегралы', 850, 0.15, 2, 'images/derivativesAndIntegrals.jpg');
INSERT INTO item (id, characteristics, code, count, created_on, description, name, price, weight, category_id, image) VALUES (9, 'Автор....................Шамин Р.В.
Издательство.............URSS
Страниц..................272
Переплёт.................Мягкий
ISBN.....................978-5-9710-7813-5', '57f8d470', 4000, '2020-06-16 00:31:52.797', 'Книга представляет собой учебник по функциональному анализу. Этот учебник годится для первоначального изучения линейного функционального анализа, но будет полезен и для углубленного изучения, поскольку содержит материал, который обычно не включают в учебники по функциональному анализу. Несмотря на краткое изложение, в учебнике все теоремы приведены с полными доказательствами. Многие понятия и утверждения демонстрируются на модельных примерах. Книга будет полезна студентам и аспирантам, а также всем желающим познакомиться с современной абстрактной математикой.
', 'Функциональный анализ от нуля до единиц', 520, 0.29, 2, 'images/functionalAnalysisFromZeroToUnits.jpg');


INSERT INTO item (id, characteristics, code, count, created_on, description, name, price, weight, category_id, image) VALUES (10, 'Производитель...................Hewlett Packard (HP)
Цвет............................Серый
Страна изготовления.............Китай
Вес без упаковки................1600 г
Гарантийный срок................12 мес.', '1494797b', 200, '2020-06-16 00:31:52.839', 'Тонкий дисплей с диагональю 35,56 см (14"), FHD (1920x1080), IPS, eDP, антибликовое покрытие.
Процессор Intel Core i3-10110U (базовая частота 2,1 ГГц, до 4,1 ГГц при использовании технологии Intel Turbo Boost, кэш-память 4 Мб, 2 ядра).
Графическая карта Intel UHD Graphics 620.
Память DDR4-2400 SDRAM, 8 Гб.
Твердотельный накопитель (SSD): 256 Гб, М.2, PCIe NVMe.
Оптический привод: нет.
Веб-камера, встроенные динамики, микрофон.
Клавиатура HP Premium Keyboard. Защита от проникновения воды с дополнительной функцией подсветки.
Сенсорная панель Clickpad с поддержкой мультисенсорного ввода.
Встроенная сетевая карта Realtek GbE 10/100/1000.
Комбинированный модуль беспроводной связи Intel AX201 Wi-Fi 6 (2x2) и Bluetooth 5.
Порты:
1 - разъем USB 3.1 Type-C Gen 1 (подача электропитания, DisplayPort).
2 - USB 3.1 Gen 1.
1 - USB 2.0 (порт с питанием).
1 - HDMI 1.4b.
1 - порт RJ-45/Ethernet.
1 - комбинированный разъем для наушников/микрофона.
1 - порт питания переменного тока.
1 - стандартный замок безопасности.
Аккумулятор HP большой емкости, 3-элементный, 45 Вт/ч, литий-ионный.
Размеры: 32,42x23,77x1,80 см.', 'Ноутбук HP ProBook 440 G7, 14", Intel Core i3 10110U, 8192 Мб, Windows 10 Pro, арт. 9VZ38EA#ACB', 59320, 2.9, 5, 'images/laptopHPProBook.jpg');
INSERT INTO item (id, characteristics, code, count, created_on, description, name, price, weight, category_id, image) VALUES (11, 'Производитель...................Lenovo
Цвет............................Серый
Страна изготовления.............Китай
Вес без упаковки................1500 г
Гарантийный срок................12 мес.', 'd5149dd5', 200, '2020-06-16 00:31:52.841', 'Ноутбук Lenovo ThinkBook 14 разработан для тех, кому приходится работать в дороге. Толщина устройства всего 17,9 мм, поэтому его удобно носить в рюкзаке или в руках.
Экран 14", FHD (1920x1080), IPS, 250 nits, матовый.
Процессор Intel Core i5-1035G4 (1,1 ГГц, до 3,7 ГГц, 6 Мб кэш-память, 4 ядра).
Встроенная графика Intel Iris Plus Graphics.
Память 8 Гб, DDR4-2666.
Твердотельный накопитель (SSD): 512 Гб, M.2, 2242 PCIe NVMe 3.0x2.
Оптический привод: нет.
Дискретная видеокарта AMD Radeon 630 (2 Гб GDDR5).
Веб-камера 720p with ThinkShutter, встроенные динамики 2x2 Вт, микрофон.
4-in-1 media reader (MMC, SD, SDHC, SDXC).
Клавиатура с подсветкой. Сканер отпечатков пальцев.
Ethernet 100/1000M.
Беспроводные коммуникации: Wi-Fi 802.11ac 2x2, Bluetooth 5.0.
Порты: 1 - hidden USB 2.0, 2 - USB 3.1 Gen 1 (one with Always On),
1 - USB-C 3.1 Gen 1, 1 - USB-C 3.1 Gen 2 (with the function of DisplayPort and power delivery), HDMI 1.4b, Ethernet (RJ45).
Аккумулятор: 45 Вт/ч.
Размеры: 326x230x17.9 мм.', 'Ноутбук Lenovo ThinkBook 14-IIL, 14.0", Intel Core i5 1035G4, 8 Гб, DOS, арт. 20SL004BRU', 54220, 2.7, 5, 'images/laptopLenovoThinkBook.jpg');